[
  {
    "id": 1,
    "subject": "Технические проблемы с сайтом",
    "created": "2019-08-01 22:59",
    "parts": [
      {
        "id": 1,
        "author": "Надежда Невежда",
        "created": "2019-08-02 23:59",
        "text": "Что за дела? Сайт не работает, немедленно исправляйте"
      },
      {
        "id": 2,
        "author": "Служба техподдержки",
        "created": "2019-08-02 09:34",
        "text": "Приносим искренние извинения за доставленные неудобства. Опишите пожалуйста проблему с работой сайта?"
      },
      {
        "id": 3,
        "author": "Надежда Невежда",
        "created": "2019-08-02 11:12",
        "text": "Не нужны мне извинения, почините сайт немедленно"
      },
      {
        "id": 4,
        "author": "Служба техподдержки",
        "created": "2019-08-02 11:24",
        "text": "Нам очень жаль, но нам нужно больше информации для понимания проблемы, чем быстрей поймем Вашу проблему тем оперативнее ее решим."
      },
            {
        "id": 5,
        "author": "Надежда Невежда",
        "created": "2019-08-02 16:41",
        "text": "Зачем мне описывать проблему, не можете догадатся зайти на сайт и посмотреть"
      },
      {
        "id": 6,
        "author": "Служба техподдержки",
        "created": "2019-08-02 16:50",
        "text": "Проверили сайт, всё работает. Опишите пожалуйста Вашу проблему, чтоб у нас была возможность во всем разобраться и помочь."
      },
      {
        "id": 7,
        "author": "Надежда Невежда",
        "created": "2019-08-02 20:38",
        "text": "Вы издеваетесь надо мной? Как может все хорошо работать если не одной фотографии товара не отображено на главной странице"
      },
      {
        "id": 8,
        "author": "Служба техподдержки",
        "created": "2019-08-03 09:35",
        "text": "Вы пользуетесь блокировщиком рекламы или другими стороними расширениями в браузере?"
      },
      {
        "id": 9,
        "author": "Надежда Невежда",
        "created": "2019-08-03 10:20",
        "text": "Использую adblock, но это тут причем? Он работает прекрасно в отличие от вашего сервиса"
      },
      {
        "id": 10,
        "author": "Служба техподдержки",
        "created": "2019-08-03 11:22",
        "text": "Выявили Вашу проблему, она заключается в особеностях работы стороннего расширения adblock, он блокирует все изображения начинающиеся с 'ad'. Наш сервис не может гарантировать исправную работу при наличие расширений вмешивающихся в его работу, но в данном случае сделали исключение и решили проблему. Также перевели на счет Вашего аккаунта компенсацию за причиненные неудобства, еще раз приносим искренние извинения и желаем Вам Хорошего дня!"
      }
    ]
  },
  {
    "id": 2,
    "subject": "Предложения и пожелания",
    "created": "2019-08-06 12:34",
    "parts": [
      {
        "id": 1,
        "author": "Сергей Друзь",
        "created": "2019-08-06 12:34",
        "text": "Добрый день! Прошу реализовать возможность настройки сайта как полноэкраное мобильное приложение с оповищениями. Подсмотрел у конкурентов, если их сайт добавить на главный экран, то на главном экране появляеться иконка и переходя по ней мы не просто переходим по ссылке, а переходим на режим приложения. Вам подсилу реализовать подобную возможность?"
      },
      {
        "id": 2,
        "author": "Служба техподдержки",
        "created": "2019-08-06 13:20",
        "text": "Добрый день! Благодарны за Ваше предложение, отправили его на ознакомление в техотдел. Вскоре оповестим Вас о возможности добавления подобного функционала на сайт."
      },
      {
        "id": 3,
        "author": "Служба техподдержки",
        "created": "2019-08-08 16:08",
        "text": "Добрый день! Нам очень сильно понравилась Ваше предложение, техотдел в ближайшее время приступит к разработке. В качестве благодарности дарим Вам годовой абонемент на все услуги сервиса. Спасибо Вам огромное за вклад в развитие нашего сервиса!"
      }
    ]
  }
]